<a href="https://colab.research.google.com/github/Ayman-Abdeen/Colab-/blob/main/Pandas_old.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

First step : Import Library <br>
pandas for dealing with structural data <br>
data = rows +columns

In [ ]:
import pandas as pd

In [ ]:
headers=['Names','Age','weight'] #like keys
Values=['Abu Bakr',28,55]

In [ ]:
my_ser=pd.Series(data=Values,index=headers)

In [ ]:
print(my_ser)

Names     Abu Bakr
Age             28
weight          55
dtype: object

In [ ]:
my_ser2=pd.Series(Values)
print(my_ser2)

0    Abu Bakr
1          28
2          55
dtype: object

In [ ]:
Sem1=pd.Series(data=[25,30],index=['CS','Physics'])
Sem2=pd.Series(data=[10,20,10],index=['CS','Physics2','Algebra'])

In [ ]:
print(Sem1)

CS         25
Physics    30
dtype: int64

Before Concatentae Two Sereies <br>
You must make sure that all coloumns are common and there are NO MIssing Values

In [ ]:
print(Sem1+Sem2)

Algebra      NaN
CS          35.0
Physics      NaN
Physics2     NaN
dtype: float64

# Data Frame

Data Frame is simply a table

In [ ]:
df1=pd.DataFrame(0,index=['X','Y','Z'],columns=['C1','C2'])
print(df1)

   C1  C2
X   0   0
Y   0   0
Z   0   0

In [ ]:
df1.reset_index()# reset keys to positive integers instead of X,Y,Z

  index  C1  C2
0     X   0   0
1     Y   0   0
2     Z   0   0

In [ ]:
df1['C1']

X    0
Y    0
Z    0
Name: C1, dtype: int64

In [ ]:
import numpy as np
np.random.seed(0)

In [ ]:
df2=pd.DataFrame(np.random.rand(3,3),index=['X','Y','Z'],columns=['C1','C2','C3'])
print(df2)

         C1        C2        C3
X  0.383442  0.791725  0.528895
Y  0.568045  0.925597  0.071036
Z  0.087129  0.020218  0.832620

In [ ]:
df2['C2']# To get Second Column only

X    0.791725
Y    0.925597
Z    0.020218
Name: C2, dtype: float64

In [ ]:
df2[['C1','C3']] # To get only C1 and C3

         C1        C3
X  0.383442  0.528895
Y  0.568045  0.071036
Z  0.087129  0.832620

In [ ]:
df2['C4']=df2['C1']+df2['C2'] # Add New colunms
print(df2)

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348

In [ ]:
df2.loc['Y'] # To Print Y Row

C1    0.568045
C2    0.925597
C3    0.071036
C4    1.493641
Name: Y, dtype: float64

In [ ]:
df2.iloc[1] # integer location

C1    0.568045
C2    0.925597
C3    0.071036
C4    1.493641
Name: Y, dtype: float64

In [ ]:
df2.iloc[:2] #To Print More than One Location

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641

In [ ]:
df2.loc[['X','Y']]

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641

In [ ]:
df2.loc[['X','Y'],['C1','C3']] # To print first two rows only and first and Third column

         C1        C3
X  0.383442  0.528895
Y  0.568045  0.071036

In [ ]:
df2.loc[['X'],['C2']]

         C2
X  0.791725

In [ ]:
df2.loc['X','C2']

0.79172503808266459

In [ ]:
df2.drop('C4',axis=1) #To delete column 4, will return new data frame without C4

         C1        C2        C3
X  0.383442  0.791725  0.528895
Y  0.568045  0.925597  0.071036
Z  0.087129  0.020218  0.832620

In [ ]:
df2

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348

In [ ]:
df3=df2.drop('C4',axis=1)

In [ ]:
df3

         C1        C2        C3
X  0.383442  0.791725  0.528895
Y  0.568045  0.925597  0.071036
Z  0.087129  0.020218  0.832620

In [ ]:
df3.drop('C3',axis=1,inplace=True)# Change data frame itself

In [ ]:
df3

         C1        C2
X  0.383442  0.791725
Y  0.568045  0.925597
Z  0.087129  0.020218

In [ ]:
df3.drop('Y',axis=0,inplace=True)

In [ ]:
df3

         C1        C2
X  0.383442  0.791725
Z  0.087129  0.020218

In [ ]:
df2

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348

In [ ]:
df2.head()# To Print first n rows, By default n=5

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 4 columns):
C1    3 non-null float64
C2    3 non-null float64
C3    3 non-null float64
C4    3 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [ ]:
df2<=0 # Apply Certain Condition on Your Data Frame

      C1     C2     C3     C4
X  False  False  False  False
Y  False  False  False  False
Z  False  False  False  False

In [ ]:
np.sum(df2<=0)

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [ ]:
df2_c=df2[df2>=0.5]
print(df2)
print(df2_c)

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348
         C1        C2        C3        C4
X       NaN  0.791725  0.528895  1.175167
Y  0.568045  0.925597       NaN  1.493641
Z       NaN       NaN  0.832620       NaN

In [ ]:
df2_c.dropna() #will remove any row contains NAN 
#df2_c.dropna(axis=1,thresh=2)
df2_c.dropna(axis=0,thresh=2)
#df2_c.fillna(0)#replace nan by Zero

         C1        C2        C3        C4
X       NaN  0.791725  0.528895  1.175167
Y  0.568045  0.925597       NaN  1.493641

In [ ]:
df2_c

         C1        C2        C3        C4
X  0.000000  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.000000  1.493641
Z  0.000000  0.000000  0.832620  0.000000

In [ ]:
df2_c.fillna(0,inplace=True)

In [ ]:
df2[df2['C1']>=.5]

         C1        C2        C3        C4
Y  0.568045  0.925597  0.071036  1.493641

In [ ]:
df2

         C1        C2        C3        C4
X  0.383442  0.791725  0.528895  1.175167
Y  0.568045  0.925597  0.071036  1.493641
Z  0.087129  0.020218  0.832620  0.107348

In [ ]:
df2[(df2['C1']>=0.5) | (df2['C4']>=1.5)] #compound & and | or

         C1        C2        C3        C4
Y  0.568045  0.925597  0.071036  1.493641

In [ ]:
df2[(df2['C1']>=0.5) | (df2['C4']>=1.5)] ['C2']

Y    0.925597
Name: C2, dtype: float64

In [ ]:
np.nan

nan

# Reading Excel File

In [ ]:
F1=pd.read_excel('titanic.xls')

In [ ]:
F1.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
F1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB

In [ ]:
F1.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [ ]:
F1.shape

(1309, 14)

In [ ]:
F1.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')